# 3. Напишите программу, в которой пользователь будет задавать две строки, программа - определять количество вхождений одной строки в другой.

string = input('Input text: ')
find = input('Input what to find: ')
print(f"count = {string.count(find)}")
